* Model TODOs                                                      :noexport:
bibliography:refs.bib
** TODO Substituir letra da taxa de lucro por outra

* A Sraffian supermultiplier SFC model with residential investment   :ignore:

** General equations

Our model is the most parsimonious as possible: a closed capitalist economy without government sector. Output ($Y$) is determined by  a fixed combination of a homogeneous labor ($L$) input with homogeneous fixed business capital ($K_f$). 
For simplicity, we put technological progress, depreciation and goods inflation aside so investment is presented in net terms and all variables --- except for houses --- are measured in real terms.
Assuming a Leontief production function and that growth is not constrained by labor scarcity, full capacity output ($Y_{FC}$) is
determined by firms' capital stock:
#+BEGIN_SRC latex
\begin{equation}
\label{_Leontieff}
    Y_{FC} = \min (Y_L, Y_K)
\end{equation}
\begin{equation}
\label{_YFC}
    Y_{FC} = \frac{K_{f_{-1}}}{v}
\end{equation}
\begin{equation}
\label{_u}
    u = \frac{Y}{Y_{FC}}
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_Leontieff}
    Y_{FC} = \min (Y_L, Y_K)
\end{equation}
\begin{equation}
\label{_YFC}
    Y_{FC} = \frac{K_{f_{-1}}}{v}
\end{equation}
\begin{equation}
\label{_u}
    u = \frac{Y}{Y_{FC}}
\end{equation}
#+end_export
where $Y_L$ and $Y_K$ stands for full employment and full capacity output respectively, $v$ is exogenous capital-output ratio and $u$ is utilization rate.

We further assume an economic structure composed by both workers (denoted by subscript $w$) and capitalists (denoted by subscript $k$) households[fn::In accordance with textcite:albanesi_credit_2017, we consider that only the latter invest in real estate and are not credit constrained.].
Thus, demand-determined output level ($Y$)  is the sum of workers and capitalists consumption ($C_w$ and $C_k$ respectively) and both households and firms investment ($I_h$ and $I_f$ respectively) and only the latter creates capacity to the business sector of the economy:
#+BEGIN_SRC latex
\begin{equation}
\label{_Ct}
    C = C_w + C_k
\end{equation}
\begin{equation}
\label{_It}
    I_t = I_f + I_h
\end{equation}
\begin{equation}
\label{_Y}
    Y = \overbrace{[C_w + \underbrace{C_k + I_h}_{\text{Capitalists}}]}^{\text{Households}} + \overbrace{[I_f]}^{\text{Firms}}
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_Ct}
    C = C_w + C_k
\end{equation}
\begin{equation}
\label{_It}
    I_t = I_f + I_h
\end{equation}
\begin{equation}
\label{_Y}
    Y = \overbrace{[C_w + \underbrace{C_k + I_h}_{\text{Capitalists}}]}^{\text{Households}} + \overbrace{[I_f]}^{\text{Firms}}
\end{equation}
#+end_export

In other words, from institutional sectors perspective, household expenditures have two components (consumption and residential investment) and firms just one (non-residential investment).
So, the novelty of this model is the inclusion of a second investment component all made by household sector and held by capitalists households for simplicity. 
Therefore, this economy produces two types of real assets: firms productive capital ($K_f$) and households housing ($K_h$):
#+BEGIN_SRC latex
\begin{equation}
    \label{_K}
    K = K_f + K_h
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
    \label{_K}
    K = K_f + K_h
\end{equation}
#+end_export

Denoting the houses share in total real assets as $k$, we can rewrite equation \ref{_K} as:
#+BEGIN_SRC latex
\begin{equation}
\label{_k}
    k = \frac{K_h}{K}
\end{equation}
$$
K = (1-k)\cdot K + k\cdot K
$$
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_k}
    k = \frac{K_h}{K}
\end{equation}
$$
K = (1-k)\cdot K + k\cdot K
$$
#+end_export

Following Sraffian literature, functional income distribution is determined both by historical-institutional factors and class struggle. 
As consequence, wage-share ($\omega$) is considered exogenous to out model and define total wages as ($W$, Eq. ref:_W): 

#+BEGIN_SRC latex
\begin{equation}
\label{_W}
    W = \omega\cdot Y
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_W}
    W = \omega\cdot Y
\end{equation}
#+end_export

Table \ref{Matriz_Estoques} presents the balance sheet matrix for all institutional sectors. 
Capitalists households hold financial wealth as bank deposits ($M$) and residential investment is financed by mortgages ($MO$).
Capitalists' total net wealth ($NW_{k}$) is the sum of their net financial wealth ($V_{k}$) and real assets (\textit{i.e.} housing, $K_h$). 
Table  \ref{Matriz_Fluxos} presents both transactions flows and the flow of funds matrix. 
This table shows all economic relations between institutional sectors ensuring that there is no  ``black holes''
so all financial and real transaction are explicitly defined cite:macedo_e_silva_peering_2011.

In this model, capitalist consumption ($C_k$) is fully autonomous and financed by loans ($L_{k}$) while workers consumption ($C_w$) is fully induced by their wages.
We assume that workers expend what they earn while capitalists earn what they expend, so workers financial and real wealth are both null.
Firms finance their investment primarily by undistributed profits ($FU$) and the residual by bank loans ($L_f$) --- thus they do not hold deposits. 
Banks create credit \textit{ex nihilo} and then collect the deposits, paying the same interest rate that they charge.
On the following subsections, we will present the equations of each of these institutional sectors.



#+BEGIN_SRC latex :tangle ./tabs/Stocks.tex
\begin{table}[H]
\centering
\caption{Balance Sheet matrix}
\label{Matriz_Estoques}
\begin{tabular}{lccccc}
\hline
\hline
                          & Workers & Capitalists      & Firms        & Banks  &    $\sum$ \\ \hline

Deposits & & $+M$ & & $-M$ & 0\\
Loans& &$-L_{k}$ &$-L_f$& $+L$ & 0\\
Mortages & &$-MO$&  & $+MO$ & 0\\\hline
$\sum$ Net Financial Wealth &--- &$V_{k}$&$V_f$&$V_b$& $0$\\\hline
Capital & & &$+K_f$&  & $+K_f$\\
Houses & &$+K_{hd}$& &   & $+K_h$\\\hline
$\sum$ Net Wealth &---&$NW_{k}$&$NW_f$&$NW_b$& $+K$\\
\hline
\hline
\end{tabular}%
\caption*{\textbf{Source:} Authors' Elaboration}
\end{table}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{table}[H]
\centering
\caption{Balance Sheet matrix}
\label{Matriz_Estoques}
\begin{tabular}{lccccc}
\hline
\hline
                          & Workers & Capitalists      & Firms        & Banks  &    $\sum$ \\ \hline

Deposits & & $+M$ & & $-M$ & 0\\
Loans& &$-L_{k}$ &$-L_f$& $+L$ & 0\\
Mortages & &$-MO$&  & $+MO$ & 0\\\hline
$\sum$ Net Financial Wealth &--- &$V_{k}$&$V_f$&$V_b$& $0$\\\hline
Capital & & &$+K_f$&  & $+K_f$\\
Houses & &$+K_{hd}$& &   & $+K_h$\\\hline
$\sum$ Net Wealth &---&$NW_{k}$&$NW_f$&$NW_b$& $+K$\\
\hline
\hline
\end{tabular}%
\caption*{\textbf{Source:} Authors' Elaboration}
\end{table}
#+end_export


#+BEGIN_SRC latex :tangle ./tabs/Flows.tex
\begin{table}[H]
\centering
\caption{Transactions flow matrix and flow of funds
}
\label{Matriz_Fluxos}
\resizebox{\textwidth}{!}{%
\begin{tabular}{lccccccc}
\hline
\hline
& Workers
& \multicolumn{2}{c}{Capitalists}
& \multicolumn{2}{c}{Firms}                        
& Banks       & Total    \\ \cline{3-4}\cline{5-6}
& &
Current & Capital & 
Current & Capital     & 
&       $\sum$ \\ 
Consumption                       &$-Cw$&$-C_k$& & $+C$& & & 0\\
Non-residential Investment                   & & & &$+I_f$&$-I_f$ & & 0\\
Residential Investment       &  & &$-I_h$&$+I_h$& & & 0\\
\textbf{{[}Output{]}}   & & & &{[}$Y${]}& & & {[}$Y${]}\\
Wages                        &$+W$&& &$-W$& & & 0\\
Profits                      & &$+FD$& &$-FT$&$+FU$& & 0\\
Deposits interest rate         & &$+r_m\cdot M_{-1}$& && &$-r_m\cdot M_{-1}$& 0\\
Loans interest rate         & &$-r_l\cdot L_{k_{-1}}$& &$-r_l\cdot L_{f_{-1}}$& &$+r_l\cdot L_{-1}$& 0\\

Mortages interest rates         & &$-r_{mo}\cdot MO_{-1}$& && &$+r_{mo}\cdot MO_{-1}$& 0\\\hline
\textbf{Subtotal}           &---&$+S_h$&$-I_h$& &$+NFW_f$&$+NFW_b$& 0\\\hline
Change in deposits     & &$-\Delta M$& & & &$+\Delta M$& 0\\
Change in mortgages     & & &$+ \Delta MO$& & &$-\Delta MO$& 0\\
Change in loans     & &$+\Delta L_{k}$&&$+\Delta L_f$& &$-\Delta L$& 0\\
\textbf{Total} & & 0 & 0 & 0  & 0  & 0  & 0\\
\hline
\hline
\end{tabular}%
}
\caption*{\textbf{Source:} Authors' Elaboration}
\end{table}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{table}[H]
\centering
\caption{Transactions flow matrix and flow of funds
}
\label{Matriz_Fluxos}
\resizebox{\textwidth}{!}{%
\begin{tabular}{lccccccc}
\hline
\hline
& Workers
& \multicolumn{2}{c}{Capitalists}
& \multicolumn{2}{c}{Firms}                        
& Banks       & Total    \\ \cline{3-4}\cline{5-6}
& &
Current & Capital & 
Current & Capital     & 
&       $\sum$ \\ 
Consumption                       &$-Cw$&$-C_k$& & $+C$& & & 0\\
Non-residential Investment                   & & & &$+I_f$&$-I_f$ & & 0\\
Residential Investment       &  & &$-I_h$&$+I_h$& & & 0\\
\textbf{{[}Output{]}}   & & & &{[}$Y${]}& & & {[}$Y${]}\\
Wages                        &$+W$&& &$-W$& & & 0\\
Profits                      & &$+FD$& &$-FT$&$+FU$& & 0\\
Deposits interest rate         & &$+r_m\cdot M_{-1}$& && &$-r_m\cdot M_{-1}$& 0\\
Loans interest rate         & &$-r_l\cdot L_{k_{-1}}$& &$-r_l\cdot L_{f_{-1}}$& &$+r_l\cdot L_{-1}$& 0\\

Mortages interest rates         & &$-r_{mo}\cdot MO_{-1}$& && &$+r_{mo}\cdot MO_{-1}$& 0\\\hline
\textbf{Subtotal}           &---&$+S_h$&$-I_h$& &$+NFW_f$&$+NFW_b$& 0\\\hline
Change in deposits     & &$-\Delta M$& & & &$+\Delta M$& 0\\
Change in mortgages     & & &$+ \Delta MO$& & &$-\Delta MO$& 0\\
Change in loans     & &$+\Delta L_{k}$&&$+\Delta L_f$& &$-\Delta L$& 0\\
\textbf{Total} & & 0 & 0 & 0  & 0  & 0  & 0\\
\hline
\hline
\end{tabular}%
}
\caption*{\textbf{Source:} Authors' Elaboration}
\end{table}
#+end_export


** Firms

In order to produce, firms purchase capital goods ($-I_f$ in capital account) and hire workers, whom total remuneration is the economy wage bill. 
Their total profits ($FT$) are a residual between sales ($Y$) and total wages ($W$). 
Firms retain part ($\gamma_F$) of profits net of interest payments ($FU$) --- to reinvest --- and distribute the rest to capitalists ($FD$):

#+BEGIN_SRC latex
\begin{equation}
\label{_FT}
    FT = Y - W = FD + FU
\end{equation}
\begin{equation}
    FU = \gamma_F\cdot (FT - r_l\cdot L_{f_{-1}})
\end{equation}
\begin{equation}
    FD = (1-\gamma_F)\cdot (FT - r_l\cdot L_{f_{-1}})
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_FT}
    FT = Y - W = FD + FU
\end{equation}
\begin{equation}
    FU = \gamma_F\cdot (FT - r_l\cdot L_{f_{-1}})
\end{equation}
\begin{equation}
    FD = (1-\gamma_F)\cdot (FT - r_l\cdot L_{f_{-1}})
\end{equation}
#+end_export

Firms (non-residential) investment is fully induced by the level of effective demand (Eq. ref:_If), and its growth rate changes accordingly to the capital stock adjustment principle cite:freitas_growth_2015.
Equation ref:_h in one simple way to describe this mechanism.
According to it, the marginal propensity to invest ($h$) endogenously adjust to discrepancies between actual and normal utilization rates ($u$ and $u_N$, respectively). 
For this mechanism to take place, the adjustment parameter ($\gamma_u$) must be sufficiently small and non-negative[fn:: The size of this parameter guards a fundamental relation to the stability of the model, as shown by textcite:freitas_growth_2015.]. 
As a consequence, productive capacity gradually adjusts to effective demand movements.

#+BEGIN_SRC latex
\begin{equation}
\label{_If}
    I_f = h_{t-1}\cdot Y
\end{equation}
\begin{equation}
\label{_h}
    \Delta h = h_{t-1}\cdot \gamma_u\cdot (u - u_N)
\end{equation}
\begin{equation}
    \Delta K_f = I_f
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_If}
    I_f = h_{t-1}\cdot Y
\end{equation}
\begin{equation}
\label{_h}
    \Delta h = h_{t-1}\cdot \gamma_u\cdot (u - u_N)
\end{equation}
\begin{equation}
    \Delta K_f = I_f
\end{equation}
#+end_export


Firms finance part of investment that exceeds undistributed profits by bank loans, paying an interest rate on it ($r_l$) charged by the banks. 
We assume an elastic supply of credit for investment. 
Moreover, tables \ref{Matriz_Estoques} and \ref{Matriz_Fluxos} show firms net wealth ($NW_f$) and net financial balance ($NFW_f$) explicitly:

#+BEGIN_SRC latex
\begin{equation}
\label{_Lf}
    \Delta L_f = I_f - FU
\end{equation}
\begin{equation}
\label{_rg}
r_g = \frac{(1-\omega)\cdot u}{v}
\end{equation}
\begin{equation}
\label{_rn}
r_n = r_g - r_l\cdot\frac{L_{f_{-1}}}{K_f}
\end{equation}
\begin{equation}
    NFW_f = FU - I_f
\end{equation}
\begin{equation}
    NW_f = K_f - L_f
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_Lf}
    \Delta L_f = I_f - FU
\end{equation}
\begin{equation}
\label{_rg}
r_g = \frac{(1-\omega)\cdot u}{v}
\end{equation}
\begin{equation}
\label{_rn}
r_n = r_g - r_l\cdot\frac{L_{f_{-1}}}{K_f}
\end{equation}
\begin{equation}
    NFW_f = FU - I_f
\end{equation}
\begin{equation}
    NW_f = K_f - L_f
\end{equation}
#+end_export
where $r_g$ and $r_n$ denotes gross and net profit rate respectively.

** Banks

As in most part of SFC literature, banks do not have an active role in this model.
They create money as credit is demanded and just after they collect deposits cite:le_bourva_money_1992. 
Firms finance part of their investment with credit ($L_f$) and capitalists households finance all their residential investment by mortgages ($MO$) and consumption by loans ($L_{k}$), as already mentioned.
For simplicity, we assume null bank spreads ($\sigma_{mo} = \sigma_l = 0$) so interest rate on mortgages ($r_{mo}$) and on loans ($r_{l}$)
are the same as on deposits ($r_{m}$) which is  exogenously determined by banks.
Banks net balances ($NFW_b$) are defined by interests received net of interests payments. 
As those interests are the same, banks net wealth is necessarily zero (see table \ref{Matriz_Estoques}) and deposits are residuum:

#+BEGIN_SRC latex
\begin{equation}
L = L_f + L_{k}
\end{equation}
\begin{equation}
    r_l = (1+\sigma_l)\cdot r_m
\end{equation}
\begin{equation}
    r_{mo} = (1+\sigma_{mo})\cdot r_m
\end{equation}
\begin{equation}
    r_m = \overline r_m
\end{equation}
\begin{equation}
    NFW_b = r_{mo}\cdot MO_{-1} + r_l\cdot L_{-1} - r_m\cdot M_{-1}
\end{equation}
$$
NFW_b = \Delta MO + \Delta L - \Delta M
$$
\begin{equation}
    NW_b = V_b \equiv 0
\end{equation}
\begin{equation}
\label{_M}
    \Delta M = \Delta L + \Delta MO
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
L = L_f + L_{k}
\end{equation}
\begin{equation}
    r_l = (1+\sigma_l)\cdot r_m
\end{equation}
\begin{equation}
    r_{mo} = (1+\sigma_{mo})\cdot r_m
\end{equation}
\begin{equation}
    r_m = \overline r_m
\end{equation}
\begin{equation}
    NFW_b = r_{mo}\cdot MO_{-1} + r_l\cdot L_{-1} - r_m\cdot M_{-1}
\end{equation}
$$
NFW_b = \Delta MO + \Delta L - \Delta M
$$
\begin{equation}
    NW_b = V_b \equiv 0
\end{equation}
\begin{equation}
\label{_M}
    \Delta M = \Delta L + \Delta MO
\end{equation}
#+end_export

** Households

*** Workers
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

As mentioned before, we assume that workers expend ($C_w$) what they earn ($W$). 
For simplicity, we consider that wages are the only source of income workers' disposable income ($YD_{w}$) and do not have access to consumption loans, so worker' saving ($S_{hw}$) are null.
Therefore, accordingly to our hypothesis, workers' do not hold both net financial and total wealth ($V_{w}$).

#+BEGIN_SRC latex
\begin{equation}
C_w = W
\end{equation}
\begin{equation}
YD_w = W
\end{equation}
\begin{equation}
S_{w} = YD_w - C_w
\end{equation}
$$
S_{w} = 0
$$
\begin{equation}
NFW_{w} = S_{w} = 0
\end{equation}
\begin{equation}
V_{w} = 0
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
C_w = W
\end{equation}
\begin{equation}
YD_w = W
\end{equation}
\begin{equation}
S_{w} = YD_w - C_w
\end{equation}
$$
S_{w} = 0
$$
\begin{equation}
NFW_{w} = S_{w} = 0
\end{equation}
\begin{equation}
V_{w} = 0
\end{equation}
#+end_export

*** Capitalists
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

This is the most complex institutional sector of our model. 
We assume consumption ($C_k$) is fully-autonomous and financed by loans ($L_{k}$). 
Disposable income ($YD_k$) is the sum of distributed profits and received interests on deposits, net of interests payments
on both mortgages and loans.
Capitalists savings ($S_{k}$) are disposable income net of consumption.
At odds with SFC literature, savings are not equal to net balance ($NFW_{k}$) since we have included residential investment as in Equation ref:NFWh.

#+BEGIN_SRC latex
\begin{equation}
\Delta L_{k} = C_k
\end{equation}
\begin{equation}
    \label{EqYD}
    YD_k = FD + \overline r_m\cdot M_{-1} - r_{mo}\cdot MO_{-1} - r_{l}\cdot L_{k_{-1}}
\end{equation}
\begin{equation}
    \label{EqSh}
    S_{k} = YD_k - C_k
\end{equation}
\begin{equation}
\label{NFWh}
    NFW_{k} = S_{k} - I_h
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\Delta L_{k} = C_k
\end{equation}
\begin{equation}
    \label{EqYD}
    YD_k = FD + \overline r_m\cdot M_{-1} - r_{mo}\cdot MO_{-1} - r_{l}\cdot L_{k_{-1}}
\end{equation}
\begin{equation}
    \label{EqSh}
    S_{k} = YD_k - C_k
\end{equation}
\begin{equation}
\label{NFWh}
    NFW_{k} = S_{k} - I_h
\end{equation}
#+end_export


As mentioned before, capitalist households are the only institutional section investing in houses which is financed by mortgages as in equation (ref:EqMO). 
Thus, capitalists' total debt stock ($D$) is sum of mortgage and consumption loans (Equation ref:k_D)

#+BEGIN_EXPORT latex
  \begin{equation}
    \label{EqMO}
    \Delta MO = I_h
  \end{equation}
  \begin{equation}
    \label{k_D}
    D =  MO + L_k
  \end{equation}
#+END_EXPORT



Next, we present residential investment growth rate ($g_{I_h}$) as determined by houses own rate of interest ($own$, equation \ref{_own}) as introduced by textcite:teixeira_crescimento_2015 and discussed in section ref:sec:empirical.


#+BEGIN_SRC latex
\begin{equation}
    I_h = (1 + g_{I_h})\cdot Ih_{-1}
\end{equation}
\begin{equation}
\label{g_Z_own}
g_{I_h} = \phi_0 - \phi_1\cdot own
\end{equation}


#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
    I_h = (1 + g_{I_h})\cdot Ih_{-1}
\end{equation}
\begin{equation}
\label{g_Z_own}
g_{I_h} = \phi_0 - \phi_1\cdot own
\end{equation}
#+end_export
where  $\phi_0$ represents long-term determinants of residential investment (/e.g./ demographic factors, housing and credit policies, etc.)[fn::For an early discussion about long-term determinants of residential investment see textcite:grebler_capital_1956. For a historical-institutional discussing of mortgage markets, see textcite:green_american_2005.] while $\phi_1$ captures the demand for housing arising from expectations of capital gains resulting from speculation with flow of new houses. 

Accordingly to our hypothesis, nominal ($V_{nk}$) and real net wealth ($V_{k}$) are distinguished only by the inclusion of real estate price ($p_h$) and are defined as follows:
#+BEGIN_SRC latex
\begin{equation}
V_{k} = K_{hd} + M - L_{k} - MO
\end{equation}
\begin{equation}
V_{nk} = K_{hd}\cdot p_h + M - L_{k} - MO
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
V_{k} = K_{hd} + M - L_{k} - MO
\end{equation}
\begin{equation}
V_{nk} = K_{hd}\cdot p_h + M - L_{k} - MO
\end{equation}
#+end_export


In order to fulfill our goals, we employ \citeauthor*{freitas_baseline_2020}'s citeyear:freitas_baseline_2020 procedure in which NCC autonomous expenditure ($Z$) composition ($R$) remains unchanged. Thus, we can express capitalists total consumption as follows:

#+BEGIN_SRC latex
\begin{equation}
\label{_Z}
Z = C_k + I_h
\end{equation}
$$
\frac{C_k}{Z} + \frac{I_h}{Z} = R + (1-R)
$$
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
\label{_Z}
Z = C_k + I_h
\end{equation}
$$
\frac{C_k}{Z} + \frac{I_h}{Z} = R + (1-R)
$$
#+end_export
which allows us to rewrite both residential investment and autonomous consumption in terms of residential investment (Eq. ref:Z_Ih):
\begin{equation}
\label{_Ck}
    C_k = R\cdot Z
\end{equation}
\begin{equation}
\label{Z_Ih}
Z = \frac{I_h}{(1-R)}
\end{equation}

\begin{equation}
\label{C_kZ}
C_{k} = I_h\cdot \frac{R}{(1-R)}
\end{equation}

#+BEGIN_comment
As households are the only institutional sector investing in real estate, its supply ($I_{hs}$) and demand ($I_h$) are equal and the same applies to its stock.
#+BEGIN_SRC latex
\begin{equation}
    I_{hs} = I_h
\end{equation}
\begin{equation}
    K_{hs} = K_{hd}
\end{equation}
\begin{equation}
    \Delta K_{hs} = \Delta K_{hd} = I_{hs} = I_h
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{equation}
    I_{hs} = I_h
\end{equation}
\begin{equation}
    K_{hs} = K_{hd}
\end{equation}
\begin{equation}
    \Delta K_{hs} = \Delta K_{hd} = I_{hs} = I_h
\end{equation}
#+end_export
where subscripts $S$ and $D$ denote supply and demand respectively. 
#+END_comment

Finally,  we can describe NCC autonomous expenditure growth rate as follows:
#+BEGIN_equation
#+LATEX: \label{g_Z}
g_{C_{k}} = g_{Z} = g_{I_{h}} = \phi_{0} - \phi_{1}\cdot own
#+END_equation

In this section, we presented a fully-specified parsimonious model to connect asset bubbles with aggregate demand. 
In the next Section, we present the short-run and fully-adjusted position dynamics in order to show the particularities of a model with two types of capital stock in the presence of asset bubble.



#+BEGIN_COMMENT
This particular real interest rate is the most relevant for households since the holders of an asset take their price into account in the decision-making process since its variation can generate capital gains/losses \cite[p.~114]{teixeira_crescimento_2015}.
%In other words, the mortgage interest rate (numerator) captures debt service for investors --- in this case, %households --- while the real estate inflation (denominator) incorporates changes in equity. Therefore, this own %interest rate stands for the real cost in real estate from buying real estate  %(\cite[p.~53]{teixeira_crescimento_2015}).
%It worth noting that during a housing bubble periods, it is real estate inflation that governs own interest rate %dynamics.
%In other words, the lower this real interest rate is, the greater the capital gains (in real estate) for %speculating with real estate will be.
#+END_COMMENT



